==========================================
/sensorhistory - Sensor history management
==========================================

Available actions :

* GET : get some (filtered) sensor history

GET
===

/sensorhistory/id/<sensor id>/latest
------------------------------------

Get the latest value of a sensor.

Example: ::

    Method : GET
    Url : http://127.0.0.1:40405/sensorhistory/id/9/latest
    Response (application/json) :
    [
        {
            "date": "2013-10-23T18:17:20",
            "id": 3921,
            "sensor_id": 9,
            "value_num": 0.0,
            "value_str": "0"
        }
    ]

/sensorhistory/id<sensor id>/last/<number of item to get>
---------------------------------------------------------

Get the N last values of a sensor.

Example: ::

    Method : GET
    Url : http://127.0.0.1:40405/sensorhistory/id/9/last/2
    Response (application/json) :
    [
        {
            "date": "2013-10-23T18:17:11",
            "id": 3920,
            "sensor_id": 9,
            "value_num": 255.0,
            "value_str": "255"
        },
        {
            "date": "2013-10-23T18:17:20",
            "id": 3921,
            "sensor_id": 9,
            "value_num": 0.0,
            "value_str": "0"
        }
    ]

/sensorhistory/id/<sensor id>/from/<start time>{/to/<end time>}
---------------------------------------------------------------

Get the values for a sensor from <start time> to ...
<start time> and <end time> need to be timestamps

Example: ::

    Method : GET
    Url : http://127.0.0.1:40405/sensorhistory/id/9/from/1382526978/to/1382536978
    Response (application/json) :
    [
        {
            "date": "2013-10-23T18:17:11",
            "id": 3920,
            "sensor_id": 9,
            "value_num": 255.0,
            "value_str": "255"
        },
        {
            "date": "2013-10-23T18:17:20",
            "id": 3921,
            "sensor_id": 9,
            "value_num": 0.0,
            "value_str": "0"
        }
    ]

/sensorhistory/id/<sensor id>/from/<start time> {/to/<end time>}/interval/<year, month, week, day, hour, minute, second>/selector/<min(number only), max(number only), avg(number only), first, last, x>
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Tuples format
*************
.. code-block:: none

    # Minutes
    # Format : (year, month, week, day, hour, min, value)
    [(2010, 2, 7, 21, 15, 57, 56.5), (2010, 2, 7, 21, 15, 58, 62.5), (2010, 2, 7, 21, 15, 59, 68.5),
    (2010, 2, 7, 21, 16, 0, 74.5), (2010, 2, 7, 21, 16, 1, 80.5), (2010, 2, 7, 21, 16, 2, 86.5)]
    
    # Hours
    # Format : (year, month, week, day, hour, value)
    [(2010, 6, 25, 22, 19, 38.5), (2010, 6, 25, 22, 20, 40.0), (2010, 6, 25, 22, 21, 41.5),
     (2010, 6, 25, 22, 22, 43.0), (2010, 6, 25, 22, 23, 44.0), (2010, 6, 25, 23, 0, 45.5),
     (2010, 6, 25, 23, 1, 47.0), (2010, 6, 25, 23, 2, 48.0)]
    
    # Days
    # Format : (year, month, week, day, value)
    [(2010, 6, 25, 22, 4.0), (2010, 6, 25, 23, 6.0), (2010, 6, 25, 24, 9.0), (2010, 6, 25, 25, 12.0),
     (2010, 6, 25, 26, 15.0), (2010, 6, 25, 27, 18.0), (2010, 6, 26, 28, 21.0)]
    
    # Weeks
    # Format : (year, week, value)
    [(2010, 29, 25.0), (2010, 30, 35.5), (2010, 31, 49.5), (2010, 32, 63.5),
     (2010, 33, 77.5), (2010, 34, 88.0)]
    {CODE}

Example: ::

    Method : GET
    Url : http://127.0.0.1:40405/sensorhistory/id/9/from/1/interval/week/selector/avg
    Response (application/json) :
    {
        "global_values": {
            "avg": 127.5,
            "max": 255.0,
            "min": 0.0
        },
        "values": [
            [
                2010,
                10,
                40,
                4,
                23,
                22.753251445086704
            ],
            [
                2010,
                10,
                40,
                5,
                0,
                22.559444444444445
            ],
            [
                2010,
                10,
                40,
                5,
                1,
                22.12887168141593
            ],
            ...
        ]
    }
